verylowfreq/arduino_core_ch32_sz/boards.txt
# See: https://arduino.github.io/arduino-cli/latest/platform-specification/

menu.clock=Clock Select
menu.xserial=U(S)ART support
menu.usb=USB support (if available)
menu.xusb=USB speed (if available)
menu.virtio=Virtual serial support

menu.opt=Optimize
menu.dbg=Debug symbols and core logs
menu.rtlib=C Runtime Library
menu.upload_method=Upload method



##############################################################################
##Suzuno32RV Board

suzuno32rv.name=Suzuno32RV
suzuno32rv.build.core=arduino
suzuno32rv.build.board=SUZUNO32RV
suzuno32rv.upload.maximum_size=229376
suzuno32rv.upload.maximum_data_size=20480
suzuno32rv.build.variant=CH32V20x/SUZUNO32RV
suzuno32rv.build.variant_h=variant_SUZUNO32RV.h
suzuno32rv.build.series=CH32V20x
suzuno32rv.build.mcu=QingKe-V4B
suzuno32rv.build.chip=CH32V203
suzuno32rv.build.march=rv32imacxw
suzuno32rv.build.mabi=ilp32
suzuno32rv.build.math_lib_gcc=-lm
suzuno32rv.build.IQ_math_RV32=
suzuno32rv.build.ch_extra_lib=-lprintf
suzuno32rv.build.board_extra_flags=
suzuno32rv.debug.tool=gdb-WCH_LinkE
suzuno32rv.bootloader.file={runtime.platform.path}/bootloader/catbootloader-v0.3.2.hex
suzuno32rv.bootloader.address=0x08000000


# USB support
suzuno32rv.menu.usb.tinyusb_usbd=Adafruit TinyUSB with USBD
suzuno32rv.menu.usb.tinyusb_usbd.build.usb_flags=-DUSBCON -DUSE_TINYUSB -DCFG_TUD_ENABLED=1 -DCFG_TUD_WCH_USBIP_FSDEV=1 "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
suzuno32rv.menu.usb.tinyusb_usbd_usbfsh=Adafruit TinyUSB with USBD/USBFS Host
suzuno32rv.menu.usb.tinyusb_usbd_usbfsh.build.usb_flags=-DUSBCON -DUSE_TINYUSB -DCFG_TUD_ENABLED=1 -DCFG_TUD_WCH_USBIP_FSDEV=1 -DCFG_TUH_ENABLED=1 -DCFG_TUH_WCH_USBIP_USBFS=1 "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
suzuno32rv.menu.usb.none=None
suzuno32rv.menu.usb.none.build.usb_flags=

# Upload menu
suzuno32rv.menu.upload_method.ispMethod=WCH-ISP
suzuno32rv.menu.upload_method.ispMethod.upload.protocol=
suzuno32rv.menu.upload_method.ispMethod.upload.options=
suzuno32rv.menu.upload_method.ispMethod.upload.tool=wchisp
suzuno32rv.menu.upload_method.ispMethod.bootloader.tool=wchisp
suzuno32rv.menu.upload_method.swdMethod=WCH-SWD
suzuno32rv.menu.upload_method.swdMethod.upload.protocol=
suzuno32rv.menu.upload_method.swdMethod.upload.options=
suzuno32rv.menu.upload_method.swdMethod.upload.tool=WCH_linkE
suzuno32rv.menu.upload_method.swdMethod.bootloader.tool=WCH_linkE
suzuno32rv.menu.upload_method.catbootMethod=CAT Bootloader
suzuno32rv.menu.upload_method.catbootMethod.upload.protocol=
suzuno32rv.menu.upload_method.catbootMethod.upload.options=
suzuno32rv.menu.upload_method.catbootMethod.upload.tool=catbootloader
suzuno32rv.menu.upload_method.catbootMethod.build.ldscript=Link_bootloader.ld
suzuno32rv.menu.upload_method.catbootMethod.build.flash_base=0x08000000
suzuno32rv.menu.upload_method.catbootMethod.build.flash_offset=0x00004000
suzuno32rv.menu.upload_method.catbootMethod.build.family_id=0x699b62ec

# Clock Select
suzuno32rv.menu.clock.144MHz_HSI=144MHz Internal
suzuno32rv.menu.clock.144MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_144MHz_HSI=144000000 -DF_CPU=144000000
suzuno32rv.menu.clock.120MHz_HSI=120MHz Internal
suzuno32rv.menu.clock.120MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_120MHz_HSI=120000000 -DF_CPU=120000000
suzuno32rv.menu.clock.96MHz_HSI=96MHz Internal
suzuno32rv.menu.clock.96MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_96MHz_HSI=96000000 -DF_CPU=96000000
suzuno32rv.menu.clock.72MHz_HSI=72MHz Internal
suzuno32rv.menu.clock.72MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_72MHz_HSI=72000000 -DF_CPU=72000000
suzuno32rv.menu.clock.56MHz_HSI=56MHz Internal
suzuno32rv.menu.clock.56MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_56MHz_HSI=56000000 -DF_CPU=56000000
suzuno32rv.menu.clock.48MHz_HSI=48MHz Internal
suzuno32rv.menu.clock.48MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_48MHz_HSI=48000000 -DF_CPU=48000000
suzuno32rv.menu.clock.HSI=HSI Internal
suzuno32rv.menu.clock.HSI.build.flags.clock=-DSYSCLK_FREQ_HSI=HSI_VALUE -DF_CPU=HSI_VALUE
suzuno32rv.menu.clock.144MHz_HSE=144MHz External
suzuno32rv.menu.clock.144MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_144MHz_HSE=144000000 -DF_CPU=144000000
suzuno32rv.menu.clock.120MHz_HSE=120MHz External
suzuno32rv.menu.clock.120MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_120MHz_HSE=120000000 -DF_CPU=120000000
suzuno32rv.menu.clock.96MHz_HSE=96MHz External
suzuno32rv.menu.clock.96MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_96MHz_HSE=96000000 -DF_CPU=96000000
suzuno32rv.menu.clock.72MHz_HSE=72MHz External
suzuno32rv.menu.clock.72MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_72MHz_HSE=72000000 -DF_CPU=72000000
suzuno32rv.menu.clock.56MHz_HSE=56MHz External
suzuno32rv.menu.clock.56MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_56MHz_HSE=56000000 -DF_CPU=56000000
suzuno32rv.menu.clock.48MHz_HSE=48MHz External
suzuno32rv.menu.clock.48MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_48MHz_HSE=48000000 -DF_CPU=48000000
suzuno32rv.menu.clock.HSE=HSE External
suzuno32rv.menu.clock.HSE.build.flags.clock=-DSYSCLK_FREQ_HSE=HSE_VALUE -DF_CPU=HSE_VALUE


# Optimizations
suzuno32rv.menu.opt.osstd=Smallest (-Os default)
suzuno32rv.menu.opt.osstd.build.flags.optimize=-Os
suzuno32rv.menu.opt.oslto=Smallest (-Os) with LTO
suzuno32rv.menu.opt.oslto.build.flags.optimize=-Os -flto
suzuno32rv.menu.opt.o1std=Fast (-O1)
suzuno32rv.menu.opt.o1std.build.flags.optimize=-O1
suzuno32rv.menu.opt.o1lto=Fast (-O1) with LTO
suzuno32rv.menu.opt.o1lto.build.flags.optimize=-O1 -flto
suzuno32rv.menu.opt.o2std=Faster (-O2)
suzuno32rv.menu.opt.o2std.build.flags.optimize=-O2
suzuno32rv.menu.opt.o2lto=Faster (-O2) with LTO
suzuno32rv.menu.opt.o2lto.build.flags.optimize=-O2 -flto
suzuno32rv.menu.opt.o3std=Fastest (-O3)
suzuno32rv.menu.opt.o3std.build.flags.optimize=-O3
suzuno32rv.menu.opt.o3lto=Fastest (-O3) with LTO
suzuno32rv.menu.opt.o3lto.build.flags.optimize=-O3 -flto
suzuno32rv.menu.opt.ogstd=Debug (-Og)
suzuno32rv.menu.opt.ogstd.build.flags.optimize=-Og
suzuno32rv.menu.opt.o0std=No Optimization (-O0)
suzuno32rv.menu.opt.o0std.build.flags.optimize=-O0


# Debug information
suzuno32rv.menu.dbg.none=None
suzuno32rv.menu.dbg.none.build.flags.debug=-DNDEBUG
suzuno32rv.menu.dbg.enable_sym=Symbols Enabled (-g)
suzuno32rv.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
suzuno32rv.menu.dbg.enable_log=Core logs Enabled
suzuno32rv.menu.dbg.enable_log.build.flags.debug=
suzuno32rv.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
suzuno32rv.menu.dbg.enable_all.build.flags.debug=-g


# C Runtime Library
suzuno32rv.menu.rtlib.nano=Newlib Nano (default)
suzuno32rv.menu.rtlib.nano.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs
suzuno32rv.menu.rtlib.nanofp=Newlib Nano + Float Printf
suzuno32rv.menu.rtlib.nanofp.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs -u _printf_float
suzuno32rv.menu.rtlib.nanofs=Newlib Nano + Float Scanf
suzuno32rv.menu.rtlib.nanofs.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs -u _scanf_float
suzuno32rv.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
suzuno32rv.menu.rtlib.nanofps.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs -u _printf_float -u _scanf_float
suzuno32rv.menu.rtlib.full=Newlib Standard
suzuno32rv.menu.rtlib.full.build.flags.ldflags=--specs=nosys.specs




