verylowfreq/arduino_core_ch32_sz/boards.txt
##############################################################################
##Suzuduino UNO Board

suzuduino_uno.name=Suzuduino UNO
suzuduino_uno.build.core=arduino
suzuduino_uno.build.board=SUZUDUINO_UNO
suzuduino_uno.upload.maximum_size=229376
suzuduino_uno.upload.maximum_data_size=20480
suzuduino_uno.build.variant=CH32V20x/SUZUDUINO_UNO
suzuduino_uno.build.variant_h=variant_SUZUDUINO_UNO.h
suzuduino_uno.build.series=CH32V20x
suzuduino_uno.build.mcu=QingKe-V4B
suzuduino_uno.build.chip=CH32V203
suzuduino_uno.build.march=rv32imacxw
suzuduino_uno.build.mabi=ilp32
suzuduino_uno.build.math_lib_gcc=-lm
suzuduino_uno.build.IQ_math_RV32=
suzuduino_uno.build.ch_extra_lib=-lprintf
suzuduino_uno.build.board_extra_flags=
suzuduino_uno.debug.tool=gdb-WCH_LinkE
suzuduino_uno.bootloader.file={runtime.platform.path}/bootloader/catbootloader-v0.3.2.hex
suzuduino_uno.bootloader.address=0x08000000


# USB support
suzuduino_uno.menu.usb.tinyusb_usbd=Adafruit TinyUSB with USBD
suzuduino_uno.menu.usb.tinyusb_usbd.build.usb_flags=-DUSBCON -DUSE_TINYUSB -DCFG_TUD_ENABLED=1 -DCFG_TUD_WCH_USBIP_FSDEV=1 "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
suzuduino_uno.menu.usb.tinyusb_usbd_usbfsh=Adafruit TinyUSB with USBD/USBFS Host
suzuduino_uno.menu.usb.tinyusb_usbd_usbfsh.build.usb_flags=-DUSBCON -DUSE_TINYUSB -DCFG_TUD_ENABLED=1 -DCFG_TUD_WCH_USBIP_FSDEV=1 -DCFG_TUH_ENABLED=1 -DCFG_TUH_WCH_USBIP_USBFS=1 "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
suzuduino_uno.menu.usb.none=None
suzuduino_uno.menu.usb.none.build.usb_flags=

# Upload menu
suzuduino_uno.menu.upload_method.ispMethod=WCH-ISP
suzuduino_uno.menu.upload_method.ispMethod.upload.protocol=
suzuduino_uno.menu.upload_method.ispMethod.upload.options=
suzuduino_uno.menu.upload_method.ispMethod.upload.tool=wchisp
suzuduino_uno.menu.upload_method.ispMethod.bootloader.tool=wchisp
suzuduino_uno.menu.upload_method.swdMethod=WCH-SWD
suzuduino_uno.menu.upload_method.swdMethod.upload.protocol=
suzuduino_uno.menu.upload_method.swdMethod.upload.options=
suzuduino_uno.menu.upload_method.swdMethod.upload.tool=WCH_linkE
suzuduino_uno.menu.upload_method.swdMethod.bootloader.tool=WCH_linkE
suzuduino_uno.menu.upload_method.catbootMethod=CAT Bootloader
suzuduino_uno.menu.upload_method.catbootMethod.upload.protocol=
suzuduino_uno.menu.upload_method.catbootMethod.upload.options=
suzuduino_uno.menu.upload_method.catbootMethod.upload.tool=catbootloader
suzuduino_uno.menu.upload_method.catbootMethod.build.ldscript=Link_bootloader.ld
suzuduino_uno.menu.upload_method.catbootMethod.build.flash_base=0x08000000
suzuduino_uno.menu.upload_method.catbootMethod.build.flash_offset=0x00004000
suzuduino_uno.menu.upload_method.catbootMethod.build.family_id=0x699b62ec

# Clock Select
suzuduino_uno.menu.clock.144MHz_HSI=144MHz Internal
suzuduino_uno.menu.clock.144MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_144MHz_HSI=144000000 -DF_CPU=144000000
suzuduino_uno.menu.clock.120MHz_HSI=120MHz Internal
suzuduino_uno.menu.clock.120MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_120MHz_HSI=120000000 -DF_CPU=120000000
suzuduino_uno.menu.clock.96MHz_HSI=96MHz Internal
suzuduino_uno.menu.clock.96MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_96MHz_HSI=96000000 -DF_CPU=96000000
suzuduino_uno.menu.clock.72MHz_HSI=72MHz Internal
suzuduino_uno.menu.clock.72MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_72MHz_HSI=72000000 -DF_CPU=72000000
suzuduino_uno.menu.clock.56MHz_HSI=56MHz Internal
suzuduino_uno.menu.clock.56MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_56MHz_HSI=56000000 -DF_CPU=56000000
suzuduino_uno.menu.clock.48MHz_HSI=48MHz Internal
suzuduino_uno.menu.clock.48MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_48MHz_HSI=48000000 -DF_CPU=48000000
suzuduino_uno.menu.clock.HSI=HSI Internal
suzuduino_uno.menu.clock.HSI.build.flags.clock=-DSYSCLK_FREQ_HSI=HSI_VALUE -DF_CPU=HSI_VALUE
suzuduino_uno.menu.clock.144MHz_HSE=144MHz External
suzuduino_uno.menu.clock.144MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_144MHz_HSE=144000000 -DF_CPU=144000000
suzuduino_uno.menu.clock.120MHz_HSE=120MHz External
suzuduino_uno.menu.clock.120MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_120MHz_HSE=120000000 -DF_CPU=120000000
suzuduino_uno.menu.clock.96MHz_HSE=96MHz External
suzuduino_uno.menu.clock.96MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_96MHz_HSE=96000000 -DF_CPU=96000000
suzuduino_uno.menu.clock.72MHz_HSE=72MHz External
suzuduino_uno.menu.clock.72MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_72MHz_HSE=72000000 -DF_CPU=72000000
suzuduino_uno.menu.clock.56MHz_HSE=56MHz External
suzuduino_uno.menu.clock.56MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_56MHz_HSE=56000000 -DF_CPU=56000000
suzuduino_uno.menu.clock.48MHz_HSE=48MHz External
suzuduino_uno.menu.clock.48MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_48MHz_HSE=48000000 -DF_CPU=48000000
suzuduino_uno.menu.clock.HSE=HSE External
suzuduino_uno.menu.clock.HSE.build.flags.clock=-DSYSCLK_FREQ_HSE=HSE_VALUE -DF_CPU=HSE_VALUE


# Optimizations
suzuduino_uno.menu.opt.osstd=Smallest (-Os default)
suzuduino_uno.menu.opt.osstd.build.flags.optimize=-Os
suzuduino_uno.menu.opt.oslto=Smallest (-Os) with LTO
suzuduino_uno.menu.opt.oslto.build.flags.optimize=-Os -flto
suzuduino_uno.menu.opt.o1std=Fast (-O1)
suzuduino_uno.menu.opt.o1std.build.flags.optimize=-O1
suzuduino_uno.menu.opt.o1lto=Fast (-O1) with LTO
suzuduino_uno.menu.opt.o1lto.build.flags.optimize=-O1 -flto
suzuduino_uno.menu.opt.o2std=Faster (-O2)
suzuduino_uno.menu.opt.o2std.build.flags.optimize=-O2
suzuduino_uno.menu.opt.o2lto=Faster (-O2) with LTO
suzuduino_uno.menu.opt.o2lto.build.flags.optimize=-O2 -flto
suzuduino_uno.menu.opt.o3std=Fastest (-O3)
suzuduino_uno.menu.opt.o3std.build.flags.optimize=-O3
suzuduino_uno.menu.opt.o3lto=Fastest (-O3) with LTO
suzuduino_uno.menu.opt.o3lto.build.flags.optimize=-O3 -flto
suzuduino_uno.menu.opt.ogstd=Debug (-Og)
suzuduino_uno.menu.opt.ogstd.build.flags.optimize=-Og
suzuduino_uno.menu.opt.o0std=No Optimization (-O0)
suzuduino_uno.menu.opt.o0std.build.flags.optimize=-O0


# Debug information
suzuduino_uno.menu.dbg.none=None
suzuduino_uno.menu.dbg.none.build.flags.debug=-DNDEBUG
suzuduino_uno.menu.dbg.enable_sym=Symbols Enabled (-g)
suzuduino_uno.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
suzuduino_uno.menu.dbg.enable_log=Core logs Enabled
suzuduino_uno.menu.dbg.enable_log.build.flags.debug=
suzuduino_uno.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
suzuduino_uno.menu.dbg.enable_all.build.flags.debug=-g


# C Runtime Library
suzuduino_uno.menu.rtlib.nano=Newlib Nano (default)
suzuduino_uno.menu.rtlib.nano.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs
suzuduino_uno.menu.rtlib.nanofp=Newlib Nano + Float Printf
suzuduino_uno.menu.rtlib.nanofp.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs -u _printf_float
suzuduino_uno.menu.rtlib.nanofs=Newlib Nano + Float Scanf
suzuduino_uno.menu.rtlib.nanofs.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs -u _scanf_float
suzuduino_uno.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
suzuduino_uno.menu.rtlib.nanofps.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs -u _printf_float -u _scanf_float
suzuduino_uno.menu.rtlib.full=Newlib Standard
suzuduino_uno.menu.rtlib.full.build.flags.ldflags=--specs=nosys.specs

